In [10]:
import pandas as pd
%  matplotlib inline

In [3]:
adult = pd.read_csv('adult.csv')

In [4]:
# Top 5 records
adult.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [6]:
# Feature avaiable
for i in adult.columns:
    print(i)

age
workclass
fnlwgt
education
educational-num
marital-status
occupation
relationship
race
gender
capital-gain
capital-loss
hours-per-week
native-country
income

In [17]:
# Summary Statistics
adult.describe()

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,48842.000000,48842.000000,48842.000000,48842.000000
mean,38.643585,1.896641e+05,10.078089,1079.067626,87.502314,40.422382
std,13.710510,1.056040e+05,2.570973,7452.019058,403.004552,12.391444
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

In [19]:
adult.education.value_counts()

HS-grad         15784
Some-college    10878
Bachelors        8025
Masters          2657
Assoc-voc        2061
11th             1812
Assoc-acdm       1601
10th             1389
7th-8th           955
Prof-school       834
9th               756
12th              657
Doctorate         594
5th-6th           509
1st-4th           247
Preschool          83
Name: education, dtype: int64

In [42]:
edu = pd.crosstab(adult.education, adult.income).div(pd.crosstab(adult.education, adult.income).apply(sum,1),0)

In [51]:
adult[['educational-num','education']].drop_duplicates().set_index('educational-num')

                    education
educational-num
7                        11th
9                     HS-grad
12                 Assoc-acdm
10               Some-college
6                        10th
15                Prof-school
4                     7th-8th
13                  Bachelors
14                    Masters
16                  Doctorate
3                     5th-6th
11                  Assoc-voc
5                         9th
8                        12th
2                     1st-4th
1                   Preschool

In [50]:
pd.merge(edu, 
         adult[['educational-num','education']].drop_duplicates().set_index('educational-num'), 
         how = 'left', 
         left_index = True, right_index = True)

                 <=50K      >50K education
education
10th          0.937365  0.062635       NaN
11th          0.949227  0.050773       NaN
12th          0.926941  0.073059       NaN
1st-4th       0.967611  0.032389       NaN
5th-6th       0.946955  0.053045       NaN
7th-8th       0.935079  0.064921       NaN
9th           0.945767  0.054233       NaN
Assoc-acdm    0.742036  0.257964       NaN
Assoc-voc     0.746725  0.253275       NaN
Bachelors     0.587165  0.412835       NaN
Doctorate     0.274411  0.725589       NaN
HS-grad       0.841422  0.158578       NaN
Masters       0.450884  0.549116       NaN
Preschool     0.987952  0.012048       NaN
Prof-school   0.260192  0.739808       NaN
Some-college  0.810351  0.189649       NaN

In [ ]:
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False,
         validate=None)